Magicoe/LPC55S3x_Test_code/example_code/lpc55s3x_mdk/drivers/fsl_i3c.c
                if (xfer->direction == kI3C_Write)
                {
                    /* Make sure there is room in the tx fifo. */
                    if (0UL == txCount--)
                    {
                        state_complete = true;
                        break;
                    }

                    /* Put byte to send in fifo. */
                    dataBuff.puint8 = (uint8_t *)xfer->data;
                    if (xfer->dataSize > 1U)
                    {
                        base->MWDATAB = *dataBuff.puint8;
                    }
                    else
                    {
                        base->MWDATABE = *dataBuff.puint8;
                    }
                    dataBuff.u32 = dataBuff.u32 + 1U;
                    xfer->dataSize--;
                    xfer->data = (void *)(dataBuff.puint8);

                    /* Move to stop when the transfer is done. */
                    if (--handle->remainingBytes == 0UL)
                    {
                        handle->state = (uint8_t)kWaitForCompletionState;
                    }
                }
                else
                {
                    if (!handle->isReadTerm && (handle->remainingBytes == rxCount))
                    {
                        handle->isReadTerm  = true;
                        uint32_t mctrlValue = base->MCTRL;
                        mctrlValue &= ~I3C_MCTRL_RDTERM_MASK;
                        base->MCTRL = mctrlValue | I3C_MCTRL_RDTERM(handle->remainingBytes);
                    }

                    /* Make sure there is data in the rx fifo. */
                    if (0UL == rxCount--)
                    {
                        state_complete = true;
                        break;
                    }

                    /* Read byte from fifo. */
                    dataBuff.puint8  = (uint8_t *)xfer->data;
                    *dataBuff.puint8 = (uint8_t)base->MRDATAB;
                    dataBuff.u32     = dataBuff.u32 + 1U;
                    xfer->data       = (void *)(dataBuff.puint8);

                    /* Move to stop when the transfer is done. */
                    if (--handle->remainingBytes == 0UL)
                    {
                        handle->isReadTerm = false;
                        handle->state      = (uint8_t)kWaitForCompletionState;
                    }
                }

                break;

            case (uint8_t)kWaitForCompletionState:
                /* We stay in this state until the maste complete. */
                if (0UL != (status & (uint32_t)kI3C_MasterCompleteFlag))
                {
                    handle->state = (uint8_t)kStopState;
                }
                else
                {
                    state_complete = true;
                }

                break;

            case (uint8_t)kStopState:
                /* Only issue a stop transition if the caller requested it. */
                if (0UL == (xfer->flags & (uint32_t)kI3C_TransferNoStopFlag))
                {
                    /* Make sure there is room in the tx fifo for the stop command. */
                    if (0UL == txCount--)
                    {
                        state_complete = true;
                        break;
                    }
                    if (xfer->busType == kI3C_TypeI3CDdr)
                    {
                        I3C_MasterEmitRequest(base, kI3C_RequestForceExit);
                    }
                    else
                    {
                        (void)I3C_MasterEmitStop(base, false);
                    }
                }
                *isDone        = true;
                state_complete = true;
                break;

            default:
                assert(false);
                break;
        }
    }
    return result;
}

static status_t I3C_InitTransferStateMachine(I3C_Type *base, i3c_master_handle_t *handle)
{
    i3c_master_transfer_t *xfer = &handle->transfer;
    status_t result             = kStatus_Success;
    i3c_direction_t direction   = xfer->direction;

    if (xfer->busType != kI3C_TypeI3CDdr)
    {
        direction = (0UL != xfer->subaddressSize) ? kI3C_Write : xfer->direction;
    }

    /* Handle no start option. */
    if (0U != (xfer->flags & (uint32_t)kI3C_TransferNoStartFlag))
    {
        /* No need to send start flag, directly go to send command or data */
        if (xfer->subaddressSize > 0UL)
        {
            handle->state = (uint8_t)kSendCommandState;
        }
        else
        {
            if (direction == kI3C_Write)
            {
                /* Next state, send data. */
                handle->state = (uint8_t)kTransferDataState;
            }
            else
            {
                /* Only support write with no stop signal. */
                return kStatus_InvalidArgument;
            }
        }
        I3C_MasterTransferHandleIRQ(base, handle);
        return result;
    }
    /* If repeated start is requested, send repeated start. */
    else if (0U != (xfer->flags & (uint32_t)kI3C_TransferRepeatedStartFlag))
    {
        result = I3C_MasterRepeatedStart(base, xfer->busType, xfer->slaveAddress, direction);
    }
    else /* For normal transfer, send start. */
    {
        result = I3C_MasterStart(base, xfer->busType, xfer->slaveAddress, direction);
    }

    if (xfer->subaddressSize > 0U)
    {
        handle->state = (uint8_t)kSendCommandState;
    }
    else
    {
        handle->state = (uint8_t)kTransferDataState;
    }

    if ((handle->remainingBytes == 1U) && (direction == kI3C_Read))
    {
        handle->isReadTerm = true;
        base->MCTRL |= I3C_MCTRL_RDTERM(1U);
    }

    return result;
}

/*!
 * brief Performs a non-blocking transaction on the I2C/I3C bus.
 *
 * param base The I3C peripheral base address.
 * param handle Pointer to the I3C master driver handle.
 * param transfer The pointer to the transfer descriptor.
 * retval #kStatus_Success The transaction was started successfully.
 * retval #kStatus_I3C_Busy Either another master is currently utilizing the bus, or a non-blocking
 *      transaction is already in progress.
 */
status_t I3C_MasterTransferNonBlocking(I3C_Type *base, i3c_master_handle_t *handle, i3c_master_transfer_t *transfer)
{
    assert(NULL != handle);
    assert(NULL != transfer);
    assert(transfer->subaddressSize <= sizeof(transfer->subaddress));
    i3c_master_state_t masterState = I3C_MasterGetState(base);
    bool checkDdrState             = false;

